package cn.kingnet.utp.trade.common.enums;

/**
 * 华通银行 证件类型
 *
 * @author zhongli
 * @date 2019-03-06
 */
public enum IdType {
    /**
     * 未开户
     */
    SFZ("101", "身份证"),
    HZ("102", "护照"),
    JGZ("103", "军官证"),
    ID104("104", "武警士兵证"),
    ID105("105", "港澳居民往来内地通行证"),
    ID106("106", "户口簿"),
    ID107("107", "其他证件(个人)"),
    ID108("108", "警官证"),
    ID109("109", "执行公务证"),

    ID110("110", "士兵证"),
    ID111("111", "台湾居民来往大陆通行证"),
    ID112("112", "临时居民身份证"),
    ID113("113", "外国人居留证"),
    ID114("114", "机动车驾驶证"),
    ID115("115", "社会保障卡"),
    ID116("116", "旅行证件"),
    ID117("117", "外国身份证"),
    ID118("118", "离休干部荣誉证"),
    ID119("119", "个体工商户营业执照"),

    ID120("120", "香港居民身份证"),
    ID121("121", "澳门居民身份证"),
    ID122("122", "台湾身份证"),
    ID123("123", "学生证"),
    ID124("124", "文职干部证"),
    ID125("125", "港澳台居民居住证"),

    ID201("201", "营业执照"),
    ID202("202", "社会团体法人登记证书"),
    ID203("203", "民办非企业登记证书"),
    ID204("204", "国家登记机关颁外资企业驻华代表、办事处登记证"),
    ID205("205", "上级主管单位开户批准书"),
    ID206("206", "其他证件（对公辅助证件）"),
    ID207("207", "国税登记证"),
    ID208("208", "地税登记证"),
    ID209("209", "人行开户许可证"),

    ID210("210", "机构信用代码"),
    ID211("211", "经营外汇业务许可证"),
    ID212("212", "组织机构代码证"),
    ID213("213", "特殊机构赋码"),
    ID214("214", "企业年金计划"),
    ID215("215", "境外金融机构编码"),
    ID216("216", "其他证件（对公开户证件）"),
    ID217("217", "个体工商户营业执照"),
    ID218("218", "统一社会信用代码"),
    ID219("219", "军队类证件"),

    ID220("220", "武警类证件"),
    ID221("221", "特种经营许可证"),
    ID222("222", "涉外经营许可证"),
    ID223("223", "劳动和社会保障证"),
    ID224("224", "金融许可证"),
    ID225("225", "武警类证件"),
    ID226("226", "商业登记证"),
    ID227("227", "经营保险业务许可证"),
    ID228("228", "经营证券业务许可证"),
    ID229("229", "进出口经营权许可证书"),

    ID230("230", "外地常设机构驻在地政府主管部门批文号"),
    ID231("231", "国家主管部门颁外国驻华机构批文"),
    ID232("232", "事业法人登记证书"),
    ID233("233", "宗教事务管理部门的批文或证明号码"),
    ID234("234", "域名注册证"),
    ID235("235", "海外类证件"),
    ID236("236", "公司注册证明书"),
    ID237("237", "其他证明材料"),


    ;


    String code;
    String desc;

    IdType(String code, String desc) {
        this.code = code;
        this.desc = desc;
    }

    public String getCode() {
        return code;
    }

    public String getDesc() {
        return desc;
    }


    public static IdType getEnum(String code) {
        for (IdType typeEnum : IdType.values()) {
            if (typeEnum.code.equals(code)) {
                return typeEnum;
            }
        }
        return null;
    }

}
